import pygame
import time

# Словник, що містить таблицю азбуки Морзе для латинських букв
latin_morse_code = {
    'A': '.-', 'B': '-...', 'C': '-.-.', 'D': '-..', 'E': '.', 'F': '..-.', 'G': '--.',
    'H': '....', 'I': '..', 'J': '.---', 'K': '-.-', 'L': '.-..', 'M': '--', 'N': '-.',
    'O': '---', 'P': '.--.', 'Q': '--.-', 'R': '.-.', 'S': '...', 'T': '-', 'U': '..-',
    'V': '...-', 'W': '.--', 'X': '-..-', 'Y': '-.--', 'Z': '--..',
    '0': '-----', '1': '.----', '2': '..---', '3': '...--', '4': '....-', '5': '.....',
    '6': '-....', '7': '--...', '8': '---..', '9': '----.',
    ' ': ' '
}

# Словник, що містить таблицю азбуки Морзе для кириличних букв українського алфавіту
ukrainian_morse_code = {
    'А': '.-', 'Б': '-...', 'В': '.--', 'Г': '--.', 'Ґ': '--.', 'Д': '-..', 'Е': '.', 'Є': '.-..-',
    'Ж': '...-', 'З': '--..', 'И': '..-.', 'І': '..', 'Ї': '.---.', 'Й': '.---', 'К': '-.-', 'Л': '.-..',
    'М': '--', 'Н': '-.', 'О': '---', 'П': '.--.', 'Р': '.-.', 'С': '...', 'Т': '-', 'У': '..-',
    'Ф': '..-.', 'Х': '....', 'Ц': '-.-.', 'Ч': '---.', 'Ш': '----', 'Щ': '--.-', 'Ь': '-..-', 'Ю': '..--',
    'Я': '.-.-'
}

# Функція для відтворення символів у вигляді звуків
def play_sound(character):
    if character == '.':
        pygame.mixer.Sound('dot.wav').play()
        time.sleep(0.2)  # час паузи між символами
    elif character == '-':
        pygame.mixer.Sound('dash.wav').play()
        time.sleep(0.4)  # час паузи між символами
    else:
        time.sleep(0.6)  # час паузи між словами

# Функція для перетворення тексту у код Морзе та відтворення звуків
def text_to_morse(text):
    for char in text.upper():
        if char in latin_morse_code:
            code = latin_morse_code[char]
            for symbol in code:
                play_sound(symbol)
        elif char in ukrainian_morse_code:
            code = ukrainian_morse_code[char]
            for symbol in code:
                play_sound(symbol)

# Ініціалізація Pygame
pygame.mixer.init()

# Запит користувача на введення тексту
user_text = input("Введіть текст: ")

# Виклик функції для відтворення тексту у вигляді коду Морзе
text_to_morse(user_text)
